bobopearls/EEE-192-CANSAT-PIC32LS00/cansat_files_project/main.c
/**
 * @file main.c
 * @brief Module 5 Sample: "Keystroke Hexdump"
 *
 * @author Alberto de Villa <alberto.de.villa@eee.upd.edu.ph>
 * @date 28 Oct 2024
 */

// Common include for the XC32 compiler
#include <xc.h>
#include <string.h>
#include <stdio.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdlib.h>
#include <stdarg.h>
#include <math.h>

#include "platform.h"

/////////////////////////////////////////////////////////////////////////////

/*
 * Copyright message printed upon reset
 * 
 * Displaying author information is optional; but as always, must be present
 * as comments at the top of the source file for copyright purposes.
 * 
 * FIXME: Modify this prompt message to account for additional instructions.
 */
static const char banner_msg[] =
"\033[0m\033[2J\033[1;1H"
"+--------------------------------------------------------------------+\r\n"
"| EEE 192: CanSat                                                    |\r\n"
"|          Academic Year 2024-2025, Semester 2                       |\r\n"
"|                                                                    |\r\n"
"| BME280 Sensor Data Out Test 1                                      |\r\n"
"|                                                                    |\r\n"
"| Author:  Quitoriano, Nebres, Medina                                |\r\n"
"| Date:    05 Apr 2025                                               |\r\n"
"+--------------------------------------------------------------------+\r\n"
"\r\n"
"Sensor Status: Initializing... \r\n\r\n"
"Temperature: \r\n"
"Altitude:    \r\n"
"Pressure:    \r\n"
"Humidity:    \r\n";

static const char ESC_SEQ_STATUS[]      = "\033[11;15H\033[0K";
static const char ESC_SEQ_TEMPERATURE[] = "\033[13;13H\033[0K";
static const char ESC_SEQ_ALTITUDE[]    = "\033[14;13H\033[0K";
static const char ESC_SEQ_PRESSURE[]    = "\033[15;13H\033[0K";
static const char ESC_SEQ_HUMIDITY[]    = "\033[16;13H\033[0K";

////////////////////////////////////////////////////////////////////////////////
// https://www.bosch-sensortec.com/media/boschsensortec/downloads/datasheets/bst-bme280-ds002.pdf (data sheet)
// https://community.bosch-sensortec.com/mems-sensors-forum-jrmujtaw/post/bme280-returns-reset-values-T3qlqm036zdor2R
// from chatgpt https://learn.sparkfun.com/tutorials/qwiic-atmospheric-sensor-bme280-hookup-guide/all?utm_source=chatgpt.com
 
// defining addresses (register compatibility)
// memory mapping is shown in the bme280 datasheet table 18:
#define BME280_ADDR              0x76  //default I2C address, low address, so when it is high it will be 0x77
#define BME280_REG_ID            0xD0  //stores the chip ID of the BME280. if we read from this register, the program will know that this is the BME280
#define BME280_CHIP_ID           0x60  //unique identifier for verification and error detection
                                       //will use this to compare later to verify if the correct id is placed
#define BME280_REG_RESET         0xE0  //allows for BME280 "soft reset" but only for the sensor. 
                                       //if we write 0xB6 to this register, it does the soft reset (accd. to Bosch mauf.)
#define BME280_REG_CTRL_HUMIDITY 0xF2  //regsiter controls the humidty measurement (also oversampling)
                                       //Bits [2:0] control oversampling:
                                       //000: Humidity measurement skipped
                                       //001: 1◊ oversampling (default)
                                       //010: 2◊ oversampling
                                       //011: 4◊ oversampling
                                       //100: 8◊ oversampling
                                       //101: 16◊ oversampling NOTE: Higher oversampling is more accurate, but uses more power
#define BME280_REG_CTRL_MEAS     0xF4  //temperature and pressure measurement (oversampling and power mode)
                                       //use 0x27 (00100111 binary), which means:
                                       //Temperature: 1◊ oversampling
                                       //Pressure: 1◊ oversampling
                                       //Mode: Normal mode
#define BME280_REG_CONFIG        0xF5  //configures stand-by time, filter settings, and enabling or disabling the SPI (we don't need because I2C!)
                                       //Bits [7:5]: Standby time in normal mode:
                                       //000: 0.5ms
                                       //001: 62.5ms
                                       //010: 125ms and so on
                                       //Bits [4:2]: Filter coefficient:
                                       //000: Filter off
                                       //001: 2◊ filter
                                       //010: 4◊ filter and so on
                                       //Bit [0]: SPI interface mode (not relevant for I2C)
#define BME280_REG_DATA          0xF7  //MSB of pressure measurement data (full pressure valve requires additional reading bytes)
                                       //Pressure uses F7 to F9 (3-bytes, 20 bits)
                                       //Temperature uses FA to FC (also 3-bytes)
                                       //Humidity uses FD and FE (2-bytes, 16 bits)
#define BME280_REG_CALIB         0x88  //base address for calibrating data that stores the raw data that the sensor outputs
                                       //basically, not yet the final values since we are just getting it from non-volatile memory
                                       //from 0x88 to 0xA1, we have the Temp. Callib, 6 bytes (T1, T2, T3) and then Pres. Callib, 18 bytes (P1 to P9)
#define BME280_REG_CALIB_H1      0xA1  //contains H1 (first humidity data, separate from others)
#define BME280_REG_CALIB_H2      0xE1  //H2, then we reach till 0xE7 because we have till H6
#define SEA_LVL_PRES         101355.0  //constant standard atmospheric pressure, Po1

// structure to store data:
typedef struct {
    uint16_t T1;
    int16_t  T2, T3; //calibration for temperature measure which includes compensation of formula and temp corrections
    uint16_t P1;
    int16_t  P2, P3, P4, P5, P6, P7, P8, P9; //calibration for pressure measurement
    uint8_t  H1, H3;
    int16_t  H2, H4, H5; //humidity calibration
    int8_t   H6;
} BME280_CalibData;

