bobopearls/EEE-192-CANSAT-PIC32LS00/cansat_files_project/main.c
static BME280_CalibData cal_data; //storing the parameters of the calibration to the BME280 Sensor
static int32_t t_fine; //placeholder for the temperature value computation
////////////////////////////////////////////////////////////////////////////////
// Program state machine
typedef struct prog_state_type
{
	// Flags for this program
    // dont change flags from sample because they are in platform.h already
    // add other flags by assigning different registers which correlate to different states
#define PROG_FLAG_BANNER_PENDING	0x0001	// Waiting to transmit the banner
#define PROG_FLAG_UPDATE_PENDING	0x0002	// Waiting to transmit updates
//#define PROG_FLAG_BUTTON_PRESSED    0x0004 
#define PROG_FLAG_RESET_PENDING     0x0008 
#define PROG_FLAG_RESET_COMPLETE    0x0010 
#define PROG_FLAG_GEN_COMPLETE		0x8000	// Message generation has been done, but transmission has not occurred
#define PROG_FLAG_SENSOR_UPDATE     0x0020
    
	uint16_t flags;
    //uint16_t led_state;
	
	// Transmit stuff, Tx
	platform_usart_tx_bufdesc_t tx_desc[5]; // one for the banner, 4 more for the snesor values
	char tx_buf[64];
    uint16_t tx_blen;
    
    char status_buf[30];
    char temp_buf[20];
    char alt_buf[20];
    char pres_buf[20];
    char hum_buf[20];
	
	// Receiver stuff, Rx [WE WILL USE THIS LATER IF WE NEED USER INPUTS]
	platform_usart_rx_async_desc_t rx_desc;
	uint16_t rx_desc_blen;
	char rx_desc_buf[16];
    
    // Sensor Data
    float temperature;
    float pressure;
    float humidity;
    float altitude;
    uint32_t sensor_timer;
} prog_state_t;
//function prototypes
uint8_t BME280_INIT(void);
void BME280_READ_ALL(float *temp, float *pres, float *hum); //we want to be able to modify the temp, pressure, and humidity by updating the float values
                                                                     //these are all used as "pointer parameters". this is modified in a single function now.
                                                                     //precise floating point values since we are displaying as Celcius, Pa, etc.
float BME280_ALT(float pressure); //barometric formula: altitude = 44330(1 - (P/Po)^0.19029495) where P is the measured pressure in hPa and then Po is 1013.25 hPa

//i2c functions
static uint8_t BME_WRITE_REG(uint8_t reg, uint8_t val){
    uint8_t buf[2] = {reg, val}; //buf[0] register addr. buf[1] data to write
    return SERCOM2_I2C_Write_Polled(BME280_ADDR, buf, 2) == 2; //writing now to the BME280_ADDR, 2 BYTES
}

//i2c read operations:
static uint8_t BME_READ_REG(uint8_t reg){ //reading a single register
    uint8_t val;
    SERCOM2_I2C_Write_Polled(BME280_ADDR, &reg, 1);
    SERCOM2_I2C_Read_Polled(BME280_ADDR, &val, 1); // reading and writing 1 byte from the register
    return val;
}

static void BME_READ_MUL_REG(uint8_t reg, uint8_t *buf, uint8_t len){ //reads a block of registers
    SERCOM2_I2C_Write_Polled(BME280_ADDR, &reg, 1); //write register addr.
    SERCOM2_I2C_Read_Polled(BME280_ADDR, buf, len); //reading len number of bytes
}

// initializing the sensor
uint8_t BME280_INIT(void){
    uint8_t id = BME_READ_REG(BME280_REG_ID);
    if(id != BME280_CHIP_ID) return 0; // assigning the id
    
    // reset
    BME_WRITE_REG(BME280_REG_RESET, 0xB6); // reset value 0xB6
    
    // delay for 10ms
    uint16_t i;
    for(i = 0; i < 5000; i++) asm("nop");
    
    // read the data of temp and pressure (registers 0x88 to 0x9F)
    uint8_t buf[24]; // 2 bytes per calibration parameter
    BME_READ_MUL_REG(BME280_REG_CALIB, buf, 24);
    
    cal_data.T1 = (buf[1] << 8) | buf[0]; // MSB | LSB
    cal_data.T2 = (buf[3] << 8) | buf[2];
    cal_data.T3 = (buf[5] << 8) | buf[4];
    cal_data.P1 = (buf[7] << 8) | buf[6];
    cal_data.P2 = (buf[9] << 8) | buf[8];
    cal_data.P3 = (buf[11] << 8) | buf[10];
    cal_data.P4 = (buf[13] << 8) | buf[12];
    cal_data.P5 = (buf[15] << 8) | buf[14];
    cal_data.P6 = (buf[17] << 8) | buf[16];
    cal_data.P7 = (buf[19] << 8) | buf[18];
    cal_data.P8 = (buf[21] << 8) | buf[20];
    cal_data.P9 = (buf[23] << 8) | buf[22];
    
    //humidity calibration
    cal_data.H1 = BME_READ_REG(BME280_REG_CALIB_H1);
    
    BME_READ_MUL_REG(BME280_REG_CALIB_H2, buf, 7);
    cal_data.H2 = (buf[1] << 8) | buf[0];
    cal_data.H3 = buf[2];
    cal_data.H4 = (buf[3] << 4) | (buf[4] & 0x0F);
    cal_data.H5 = (buf[5] << 4) | (buf[4] >> 4);
    cal_data.H6 = buf[6];
    
    /*
     * BME280 Calibration Data Memory Map
     * -----------------------------------
     * Temperature & Pressure Calibration Data (Registers 0x88 - 0x9F)
     * ---------------------------------------------------------------
     * | Addr  | Data (Raw) |   Meaning  |
     * |-------|------------|------------|
     * | 0x88  | buf[0]     | T1 (LSB)   |
     * | 0x89  | buf[1]     | T1 (MSB)   |
     * | 0x8A  | buf[2]     | T2 (LSB)   |
     * | 0x8B  | buf[3]     | T2 (MSB)   |
     * | 0x8C  | buf[4]     | T3 (LSB)   |
     * | 0x8D  | buf[5]     | T3 (MSB)   |
     * | 0x8E  | buf[6]     | P1 (LSB)   |
     * | 0x8F  | buf[7]     | P1 (MSB)   |
     * | 0x90  | buf[8]     | P2 (LSB)   |
     * | 0x91  | buf[9]     | P2 (MSB)   |
     * | 0x92  | buf[10]    | P3 (LSB)   |
     * | 0x93  | buf[11]    | P3 (MSB)   |
     * | 0x94  | buf[12]    | P4 (LSB)   |
     * | 0x95  | buf[13]    | P4 (MSB)   |
     * | 0x96  | buf[14]    | P5 (LSB)   |
     * | 0x97  | buf[15]    | P5 (MSB)   |
     * | 0x98  | buf[16]    | P6 (LSB)   |
     * | 0x99  | buf[17]    | P6 (MSB)   |
     * | 0x9A  | buf[18]    | P7 (LSB)   |
     * | 0x9B  | buf[19]    | P7 (MSB)   |
     * | 0x9C  | buf[20]    | P8 (LSB)   |
     * | 0x9D  | buf[21]    | P8 (MSB)   |
     * | 0x9E  | buf[22]    | P9 (LSB)   |
     * | 0x9F  | buf[23]    | P9 (MSB)   |
     *
     * Humidity Calibration Data (Registers 0xA1, 0xE1 - 0xE7)
     * ---------------------------------------------------------
     * | Addr  |  Data (Raw)|   Meaning                          |
     * |-------|------------|------------------------------------|
     * | 0xA1  | buf[0]     | H1 (8-bit)                         |
     * |-------|------------|------------------------------------|
     * | 0xE1  | buf[0]     | H2 (LSB) (signed 16-bit)           |
     * | 0xE2  | buf[1]     | H2 (MSB)                           |
     * | 0xE3  | buf[2]     | H3 (8-bit)                         |
     * | 0xE4  | buf[3]     | H4 upper (MSB 8 bits)              |
     * | 0xE5  | buf[4]     | H4 lower (4 bits) / H5 lower (4 bits) |
     * | 0xE6  | buf[5]     | H5 upper (MSB 8 bits)              |
     * | 0xE7  | buf[6]     | H6 (signed 8-bit)                  |
     *
     * Notes:
     * - All temperature and pressure values are stored in little-endian format.
     * - H4 and H5 require special bit manipulation:
     *   - H4 = (buf[3] << 4) | (buf[4] & 0x0F);
     *   - H5 = (buf[5] << 4) | (buf[4] >> 4);
     */
    
    BME_WRITE_REG(BME280_REG_CTRL_HUMIDITY, 0x01); // humidity oversampling 1x
    BME_WRITE_REG(BME280_REG_CTRL_MEAS, 0x27); // temp, pressure both 1x, normal mode
    BME_WRITE_REG(BME280_REG_CONFIG, 0x00); //0.5ms standby, filter off
    
    return 1;
}

void BME280_READ_ALL(float *temp, float *pres, float *hum){
    // formula from the BME280 datasheet section 4.2.3 - Compensation Formulas
    uint8_t data[8];
    int32_t raw_T, raw_P, raw_H; // raw values for temp, pres, and humidity
                                 // data sheet uses adc, but to lessen confusion, used raw
    
    BME_READ_MUL_REG(BME280_REG_DATA, data, 8); // read all data at the same time
    
