bobopearls/EEE-192-CANSAT-PIC32LS00/cansat_files_project/main.c
    raw_T = ((uint32_t) data[3] << 12) | ((uint32_t) data[4] << 4) | (data[5] >> 4);
    raw_P = ((uint32_t) data[0] << 12) | ((uint32_t) data[1] << 4) | (data[2] >> 4);
    raw_H = ((uint32_t) data[6] << 8)  | data[7];
    
    /*
    Data format in the BME280 register map:

    | Addr  | Data      | Description     | Bits Used |
    |-------|-----------|------------------|-----------|
    | 0xF7  | data[0]   | Press MSB        | [19:12]   |
    | 0xF8  | data[1]   | Press LSB        | [11:4]    |
    | 0xF9  | data[2]   | Press XLSB       | [3:0]     |
    | 0xFA  | data[3]   | Temp MSB         | [19:12]   |
    | 0xFB  | data[4]   | Temp LSB         | [11:4]    |
    | 0xFC  | data[5]   | Temp XLSB        | [3:0]     |
    | 0xFD  | data[6]   | Humidity MSB     | [15:8]    |
    | 0xFE  | data[7]   | Humidity LSB     | [7:0]     |

    Data reconstruction:
    ----------------------------------------
    Pressure (20-bit): 
       adc_P = (MSB << 12) | (LSB << 4) | (XLSB >> 4)
               (data[0] << 12) | (data[1] << 4) | (data[2] >> 4)

    Temperature (20-bit): 
       adc_T = (MSB << 12) | (LSB << 4) | (XLSB >> 4)
               (data[3] << 12) | (data[4] << 4) | (data[5] >> 4)

    Humidity (16-bit):
       adc_H = (MSB << 8) | LSB
               (data[6] << 8) | data[7]
    */
    
    int32_t var1, var2;
    var1 = ((((raw_T >> 3) - ((int32_t)cal_data.T1 << 1))) * ((int32_t)cal_data.T2)) >> 11;
    var2 = (((((raw_T >> 4) - ((int32_t)cal_data.T1)) * ((raw_T >> 4) - ((int32_t)cal_data.T1))) >> 12) * ((int32_t)cal_data.T3)) >> 14;
    t_fine = var1 + var2;
    
    *temp = (t_fine * 5 + 128) >> 8;
    *temp/= 100.0f; // convert to degrees celcius by dividing w/ 100
    
    // compensating pressure, note the data sheet is 64 bit version. adjusted for 32 bit pic32
    var1 = (((int32_t)t_fine) >> 1) - 64000; // older datasheets use 64000 in the compensation formula, bmp280 uses 128000 and it is out of range
    var2 = (((var1 >> 2) * (var1 >> 2)) >> 11) * ((int32_t)cal_data.P6);
    var2 = var2 + ((var1 * ((int32_t)cal_data.P5)) << 1);
    var2 = (var2 >> 2) + (((int32_t)cal_data.P4) << 16);
    var1 = (((cal_data.P3 * (((var1 >> 1) * (var1 >> 2)) >> 13)) >> 3) + ((((int32_t)cal_data.P2) *var1) >> 1)) >> 18;
    var1 = ((((32768 + var1)) * ((int32_t)cal_data.P1)) >> 15);
    
    if(var1 == 0){
        *pres = 0;
    } else{
        uint32_t p = (((uint32_t)(((int32_t)1048576) - raw_P) - (var2 >> 12))) * 3125;
        if(p < 0x80000000){
            p = (p << 1) / ((uint32_t)var1) * 2;
        } else{
            p = (p / (uint32_t)var1) * 2;
        }
        
        var1 = (((int32_t)cal_data.P9) * ((int32_t)(((p >> 3) * (p >> 3)) >> 13))) >> 12;
        var2 = (((int32_t)(p >> 2)) * ((int32_t)cal_data.P8)) >> 13;
        p = (uint32_t)((int32_t)p + ((var1 + var2 + cal_data.P7) >> 4));
        
        *pres = p /100.0f; // converted to hPa
    }
    
    // compensating humidity
    int32_t v_x1_u32r;
    v_x1_u32r = (t_fine - ((int32_t)76800));
    v_x1_u32r = (((((raw_H << 14) - (((int32_t)cal_data.H4) << 20) - (((int32_t)cal_data.H5) * v_x1_u32r)) + 
              ((int32_t)16384)) >> 15) * (((((((v_x1_u32r * ((int32_t)cal_data.H6)) >> 10) * 
              (((v_x1_u32r * ((int32_t)cal_data.H3)) >> 11) + ((int32_t)32768))) >> 10) + ((int32_t)2097152)) * 
              ((int32_t)cal_data.H2) + 8192) >> 14)); //oh my god
    v_x1_u32r = (v_x1_u32r - (((((v_x1_u32r >> 15) * (v_x1_u32r >> 15)) >> 7) * ((int32_t)cal_data.H1)) >> 4));
    v_x1_u32r = (v_x1_u32r < 0) ? 0 : v_x1_u32r;
    v_x1_u32r = (v_x1_u32r > 419430400) ? 419430400 : v_x1_u32r;
    *hum = (v_x1_u32r >> 12) / 1024.0f;
}

float BME280_ALT(float pressure) {
    // Simplified altitude formula: altitude = 44330 * (1 - (P/P0)^(1/5.255))
    // where P0 is sea level pressure (101325 Pa)
    const float P0 = 101325.0f;
    return 44330.0f * (1.0f - pow(pressure / 10.0f / P0, 0.19029495f));
}

/*
 * Initialize the main program state
 * 
 * This style might be familiar to those accustomed to he programming
 * conventions employed by the Arduino platform.
 */
static void prog_setup(prog_state_t *ps)
{
	memset(ps, 0, sizeof(*ps));
	
	platform_init();
	
	ps->rx_desc.buf     = ps->rx_desc_buf;
	ps->rx_desc.max_len = sizeof(ps->rx_desc_buf);
    
    //display the banner with information
    ps->flags |= PROG_FLAG_BANNER_PENDING;
    ps->flags |= PROG_FLAG_UPDATE_PENDING;
    
    //display the state of the button
    //ps->flags |= PROG_FLAG_BUTTON_PRESSED;
    
    //display the (initial) state of the led
    //ps->flags |= PROG_FLAG_LED_CHANGE;
    //ps->led_state |= PROG_FLAG_LED_OFF;
    
    // initialize the bme280 sensor
    if(!BME280_INIT()){
        //then its not the bme280 (will change to other sensors when it is there)
        strcpy(ps->status_buf, "BME280 INIT FAILED");
    }
    else{
        strcpy(ps->status_buf, "BME280 FOUND, READY");
        ps->flags |= PROG_FLAG_SENSOR_UPDATE;
    }
	
	//platform_usart_cdc_rx_async(&ps->rx_desc); //ASYNC USART RX
	return;
}

/*
 * Do a single loop of the main program
 * 
 * This style might be familiar to those accustomed to he programming
 * conventions employed by the Arduino platform.
 */
static void prog_loop_one(prog_state_t *ps) {
    //uint16_t a = 0, b = 0, c = 0;
	
	// Do one iteration of the platform event loop first.
	platform_do_loop_one();
	ps-> sensor_timer++; // check if we should update sensor reading(every 1 second)
	if(ps->sensor_timer >= 500000){
        ps->sensor_timer = 0;
        
        // then read the sensor data
        BME280_READ_ALL(&ps->temperature, &ps->pressure, &ps->humidity);
        ps->altitude = BME280_ALT(ps->pressure);
        
        // Format sensor data strings
        snprintf(ps->temp_buf, sizeof(ps->temp_buf), "%.2f C", ps->temperature);
        snprintf(ps->alt_buf, sizeof(ps->alt_buf), "%.2f m", ps->altitude);
        snprintf(ps->pres_buf, sizeof(ps->pres_buf), "%.2f hPa", ps->pressure);
        snprintf(ps->hum_buf, sizeof(ps->hum_buf), "%.2f %%", ps->humidity);
        
        strcpy(ps->status_buf, "Data updated");
        
        ps->flags |= PROG_FLAG_SENSOR_UPDATE;
        ps->flags |= PROG_FLAG_UPDATE_PENDING;
    }
	
	// Something from the UART?
	if (ps->rx_desc.compl_type == PLATFORM_USART_RX_COMPL_DATA) {
		/*
		 * There's something.
		 * 
		 * The completion-info payload contains the number of bytes
		 * read into the receive buffer.
		 */ 
		ps->flags |= PROG_FLAG_UPDATE_PENDING;
		ps->rx_desc_blen = ps->rx_desc.compl_info.data_len;
	}
    
