bobopearls/EEE-192-CANSAT-PIC32LS00/cansat_files_project/main.c
    // clearing the screen when ctrl+e is pressed
    if(ps->flags & PROG_FLAG_RESET_PENDING){
        //display the banner with information
        ps->flags |= PROG_FLAG_BANNER_PENDING;
        ps->flags |= PROG_FLAG_UPDATE_PENDING;
        ps->rx_desc_blen = ps->rx_desc.compl_info.data_len; //compile info? from previous
        ps->flags &= ~PROG_FLAG_RESET_COMPLETE; // ensure a complete
        ps->flags &= ~PROG_FLAG_RESET_PENDING; // before waiting for the next thing
    }
	
	////////////////////////////////////////////////////////////////////
	
	// Process any pending flags (BANNER)
	do {
		if ((ps->flags & PROG_FLAG_BANNER_PENDING) == 0)
			break;
		
		if (platform_usart_cdc_tx_busy())
			break;
		
		if ((ps->flags & PROG_FLAG_GEN_COMPLETE) == 0) {
			// Message has not been generated.
			ps->tx_desc[0].buf = banner_msg;
			ps->tx_desc[0].len = sizeof(banner_msg)-1;
			ps->flags |= PROG_FLAG_GEN_COMPLETE;
		}
		
		if (platform_usart_cdc_tx_async(&ps->tx_desc[0], 1)) {
			ps->flags &= ~(PROG_FLAG_BANNER_PENDING | PROG_FLAG_GEN_COMPLETE);
		}
	} while (0);
	
	// Process any pending flags (UPDATE SENSOR DATA)
	do {
		if ((ps->flags & PROG_FLAG_UPDATE_PENDING) == 0)
			break;
		
		if (platform_usart_cdc_tx_busy())
			break;
		
		if ((ps->flags & PROG_FLAG_GEN_COMPLETE) == 0) {
			// Setting up the status message
			ps->tx_desc[0].buf = ESC_SEQ_STATUS;
			ps->tx_desc[0].len = sizeof(ESC_SEQ_STATUS)-1;
            ps->tx_desc[1].buf = ps->status_buf;
            ps->tx_desc[1].len = strlen(ps->status_buf);
            
            // Setting up the temperature value
			ps->tx_desc[2].buf = ESC_SEQ_TEMPERATURE;
			ps->tx_desc[2].len = sizeof(ESC_SEQ_TEMPERATURE)-1;
            
            ps->tx_desc[3].buf = ps->temp_buf;
            ps->tx_desc[3].len = strlen(ps->temp_buf);
            
            // Setting up the altitude value
            ps->tx_desc[4].buf = ESC_SEQ_ALTITUDE;
            ps->tx_desc[4].len = sizeof(ESC_SEQ_ALTITUDE)-1;
            ps->tx_desc[5].buf = ps->alt_buf;
            ps->tx_desc[5].len = strlen(ps->alt_buf);
            
            // Setup pressure value
            ps->tx_desc[6].buf = ESC_SEQ_PRESSURE;
            ps->tx_desc[6].len = sizeof(ESC_SEQ_PRESSURE)-1;
            ps->tx_desc[7].buf = ps->pres_buf;
            ps->tx_desc[7].len = strlen(ps->pres_buf);
            
            // Setup humidity value
            ps->tx_desc[8].buf = ESC_SEQ_HUMIDITY;
            ps->tx_desc[8].len = sizeof(ESC_SEQ_HUMIDITY)-1;
            ps->tx_desc[9].buf = ps->hum_buf;
            ps->tx_desc[9].len = strlen(ps->hum_buf);
            
            
			// Echo back the received packet as a hex dump.
			//memset(ps->tx_buf, 0, sizeof(ps->tx_buf));

            //snprintf(stat_buf, 25, "\033[12;16H\033[0K %s");
            
            ps->flags |= PROG_FLAG_GEN_COMPLETE;
            //ps->flags |= PROG_FLAG_RESET_COMPLETE;
            
            //ps->rx_desc_blen = 0;
        }
            
		if (platform_usart_cdc_tx_async(&ps->tx_desc[0], 10)) {
			//ps->rx_desc.compl_type = PLATFORM_USART_RX_COMPL_NONE;
			//platform_usart_cdc_rx_async(&ps->rx_desc);
			ps->flags &= ~(PROG_FLAG_UPDATE_PENDING | PROG_FLAG_GEN_COMPLETE);
		}
	} 
    while (0);
	
	// Done
	return;
    
}

// main() -- the heart of the program
int main(void)
{
	prog_state_t ps;
	
	// Initialization time	
	prog_setup(&ps);
    SERCOM2_I2C_Initialize();
	
	/*
	 * Microcontroller main()'s are supposed to never return (welp, they
	 * have none to return to); hence the intentional infinite loop.
	 */
	for (;;) {
		prog_loop_one(&ps);
	}
    
    // This line must never be reached
    return 1;
}
